# Fundamentos de Manipulação e Análise de Dados
# Desafio Bemol - XP Lab 
## Participante: Alysson Cristiano Estevam de Moura

# Manipulação de Dados

In [1]:
import pandas as pd

# Leitura de Arquivos

## Arquivos CSV

In [234]:
df_vendas = pd.read_csv('vendas.csv', sep = '|', skiprows = 0, encoding = 'utf-8')

In [235]:
df_vendas.head()

,Escritório de vendas,Fornecedor,Material,Data,Valor Liquido
0,101,Vivo,"131318 RECARGA VIRTUAL VIVO R$ 1,00",02.01.2020,20.0
1,101,Vivo,"131318 RECARGA VIRTUAL VIVO R$ 1,00",30.12.2019,10.0
2,101,Vivo,"131318 RECARGA VIRTUAL VIVO R$ 1,00",04.01.2020,20.0
3,101,Vivo,"131318 RECARGA VIRTUAL VIVO R$ 1,00",02.01.2020,10.0
4,101,Vivo,"131318 RECARGA VIRTUAL VIVO R$ 1,00",03.01.2020,25.0

## Arquivos XLSX

In [236]:
detalhamento_AM = pd.read_excel('detalhamento.xlsx', sheet_name = 'AM', skiprows = 1)
detalhamento_RR = pd.read_excel('detalhamento.xlsx', sheet_name = 'RR', skiprows = 1)
detalhamento_RO = pd.read_excel('detalhamento.xlsx', sheet_name = 'RO', skiprows = 1)
detalhamento_AC = pd.read_excel('detalhamento.xlsx', sheet_name = 'AC', skiprows = 1)

In [237]:
detalhamento_AM.head()

    NomeFantasia  Escritório de vendas  UF Operadora  Vlookup Bruto
0  BEMOL AVENIDA                   103  AM     Claro           2651
1  BEMOL AVENIDA                   103  AM        Oi           3309
2  BEMOL AVENIDA                   103  AM       Tim           1550
3  BEMOL AVENIDA                   103  AM      Vivo           4739
4  BEMOL BARROSO                   107  AM     Claro           1495

In [238]:
detalhamento_RR.head()

            NomeFantasia  Escritório de vendas  UF Operadora  Vlookup Bruto
0        BEMOL BOA VISTA                   701  RR     Claro            140
1        BEMOL BOA VISTA                   701  RR        Oi             20
2        BEMOL BOA VISTA                   701  RR       Tim            135
3        BEMOL BOA VISTA                   701  RR      Vivo            304
4  BEMOL FARMA BOA VISTA                   610  RR     Claro            260

In [239]:
detalhamento_RO.head()

              NomeFantasia  Escritório de vendas  UF Operadora  Vlookup Bruto
0  BEMOL FARMA PORTO VELHO                   609  RO     Claro            486
1  BEMOL FARMA PORTO VELHO                   609  RO        Oi             90
2  BEMOL FARMA PORTO VELHO                   609  RO       Tim             90
3  BEMOL FARMA PORTO VELHO                   609  RO      Vivo             60
4        BEMOL PORTO VELHO                   201  RO     Claro           1585

In [240]:
detalhamento_AC.head()

       NomeFantasia  Escritório de vendas  UF Operadora  Valor Bruto
0  BEMOL RIO BRANCO                   401  AC     Claro          500
1  BEMOL RIO BRANCO                   401  AC        Oi          375
2  BEMOL RIO BRANCO                   401  AC       Tim          125
3  BEMOL RIO BRANCO                   401  AC      Vivo          343

# Tratamento de Dados

## Renomeando colunas

In [241]:
df_vendas = df_vendas.rename(columns={'Escritório de vendas':'escritorio_vendas', 'Fornecedor':'operadora','Material':'material', 'Data':'data', 'Valor Liquido':'valor_liquido'})
df_vendas.head()

,escritorio_vendas,operadora,material,data,valor_liquido
0,101,Vivo,"131318 RECARGA VIRTUAL VIVO R$ 1,00",02.01.2020,20.0
1,101,Vivo,"131318 RECARGA VIRTUAL VIVO R$ 1,00",30.12.2019,10.0
2,101,Vivo,"131318 RECARGA VIRTUAL VIVO R$ 1,00",04.01.2020,20.0
3,101,Vivo,"131318 RECARGA VIRTUAL VIVO R$ 1,00",02.01.2020,10.0
4,101,Vivo,"131318 RECARGA VIRTUAL VIVO R$ 1,00",03.01.2020,25.0

In [242]:
detalhamento_AM = detalhamento_AM.rename(columns={'NomeFantasia':'nome_fantasia','Escritório de vendas':'escritorio_vendas','UF':'uf', 'Operadora':'operadora','Vlookup Bruto':'valor_bruto'})
detalhamento_AM.head()

   nome_fantasia  escritorio_vendas  uf operadora  valor_bruto
0  BEMOL AVENIDA                103  AM     Claro         2651
1  BEMOL AVENIDA                103  AM        Oi         3309
2  BEMOL AVENIDA                103  AM       Tim         1550
3  BEMOL AVENIDA                103  AM      Vivo         4739
4  BEMOL BARROSO                107  AM     Claro         1495

In [243]:
detalhamento_RR = detalhamento_RR.rename(columns={'NomeFantasia':'nome_fantasia','Escritório de vendas':'escritorio_vendas','UF':'uf', 'Operadora':'operadora','Vlookup Bruto':'valor_bruto'})
detalhamento_RR.head()

           nome_fantasia  escritorio_vendas  uf operadora  valor_bruto
0        BEMOL BOA VISTA                701  RR     Claro          140
1        BEMOL BOA VISTA                701  RR        Oi           20
2        BEMOL BOA VISTA                701  RR       Tim          135
3        BEMOL BOA VISTA                701  RR      Vivo          304
4  BEMOL FARMA BOA VISTA                610  RR     Claro          260

In [244]:
detalhamento_RO = detalhamento_RO.rename(columns={'NomeFantasia':'nome_fantasia','Escritório de vendas':'escritorio_vendas','UF':'uf', 'Operadora':'operadora','Vlookup Bruto':'valor_bruto'})
detalhamento_RO.head()

             nome_fantasia  escritorio_vendas  uf operadora  valor_bruto
0  BEMOL FARMA PORTO VELHO                609  RO     Claro          486
1  BEMOL FARMA PORTO VELHO                609  RO        Oi           90
2  BEMOL FARMA PORTO VELHO                609  RO       Tim           90
3  BEMOL FARMA PORTO VELHO                609  RO      Vivo           60
4        BEMOL PORTO VELHO                201  RO     Claro         1585

In [245]:
detalhamento_AC = detalhamento_AC.rename(columns={'NomeFantasia':'nome_fantasia','Escritório de vendas':'escritorio_vendas','UF':'uf', 'Operadora':'operadora','Valor Bruto':'valor_bruto'})
detalhamento_AC.head()

      nome_fantasia  escritorio_vendas  uf operadora  valor_bruto
0  BEMOL RIO BRANCO                401  AC     Claro          500
1  BEMOL RIO BRANCO                401  AC        Oi          375
2  BEMOL RIO BRANCO                401  AC       Tim          125
3  BEMOL RIO BRANCO                401  AC      Vivo          343

## Deletando colunas

In [246]:
df_vendas.drop(['data', 'material'], axis = 1, inplace = True) 
df_vendas.head()

   escritorio_vendas operadora  valor_liquido
0                101      Vivo           20.0
1                101      Vivo           10.0
2                101      Vivo           20.0
3                101      Vivo           10.0
4                101      Vivo           25.0

In [247]:
detalhamento_AM.drop('uf', axis = 1, inplace = True) 
detalhamento_RR.drop('uf', axis = 1, inplace = True) 
detalhamento_RO.drop('uf', axis = 1, inplace = True) 
detalhamento_AC.drop('uf', axis = 1, inplace = True)

## Verificando tipos de colunas

In [248]:
df_vendas.dtypes

escritorio_vendas      int64
operadora             object
valor_liquido        float64
dtype: object

In [249]:
detalhamento_AM.dtypes

nome_fantasia        object
escritorio_vendas     int64
operadora            object
valor_bruto           int64
dtype: object

In [250]:
detalhamento_RR.dtypes

nome_fantasia        object
escritorio_vendas     int64
operadora            object
valor_bruto           int64
dtype: object

In [251]:
detalhamento_RO.dtypes

nome_fantasia        object
escritorio_vendas     int64
operadora            object
valor_bruto           int64
dtype: object

In [252]:
detalhamento_AC.dtypes

nome_fantasia        object
escritorio_vendas     int64
operadora            object
valor_bruto           int64
dtype: object

## Alterando tipos de colunas

In [253]:
detalhamento_AM['valor_bruto'] = detalhamento_AM['valor_bruto'].astype(float)
detalhamento_RR['valor_bruto'] = detalhamento_RR['valor_bruto'].astype(float)
detalhamento_RO['valor_bruto'] = detalhamento_RO['valor_bruto'].astype(float)
detalhamento_AC['valor_bruto'] = detalhamento_AC['valor_bruto'].astype(float)

# Concatenação de tabelas

In [254]:
df_detalhamento = pd.concat([detalhamento_AM, detalhamento_RR, detalhamento_RO, detalhamento_AC])

In [255]:
df_detalhamento.reset_index(drop=True, inplace=True)

## Agrupando dados

In [256]:
df_vendas = df_vendas.groupby(['escritorio_vendas', 'operadora']).agg({'valor_liquido':'sum'}).reset_index()

In [257]:
df_detalhamento = df_detalhamento.groupby(['nome_fantasia','escritorio_vendas', 'operadora']).agg({'valor_bruto':'sum'}).reset_index()

In [258]:
df_vendas.head(10)

   escritorio_vendas operadora  valor_liquido
0                101     Claro         1527.0
1                101        Oi         1730.0
2                101       Tim          975.0
3                101      Vivo         3142.0
4                103     Claro         2652.3
5                103        Oi         3309.0
6                103       Tim         1550.0
7                103      Vivo         4739.0
8                105     Claro          720.0
9                105        Oi         2030.0

In [259]:
df_detalhamento.head(10)

     nome_fantasia  escritorio_vendas operadora  valor_bruto
0    BEMOL AVENIDA                103     Claro       2651.0
1    BEMOL AVENIDA                103        Oi       3309.0
2    BEMOL AVENIDA                103       Tim       1550.0
3    BEMOL AVENIDA                103      Vivo       4739.0
4    BEMOL BARROSO                107     Claro       1495.0
5    BEMOL BARROSO                107        Oi       1925.0
6    BEMOL BARROSO                107       Tim       1700.0
7    BEMOL BARROSO                107      Vivo       2944.0
8  BEMOL BOA VISTA                701     Claro        140.0
9  BEMOL BOA VISTA                701        Oi         20.0

# Correlação de tabelas

In [260]:
df_relatorio = pd.merge(df_vendas, df_detalhamento, on = ['escritorio_vendas', 'operadora'], how ='left')

In [261]:
df_relatorio.head(10)

   escritorio_vendas operadora  valor_liquido    nome_fantasia  valor_bruto
0                101     Claro         1527.0     BEMOL MATRIZ       1527.0
1                101        Oi         1730.0     BEMOL MATRIZ       1730.0
2                101       Tim          975.0     BEMOL MATRIZ        975.0
3                101      Vivo         3142.0     BEMOL MATRIZ       3142.0
4                103     Claro         2652.3    BEMOL AVENIDA       2651.0
5                103        Oi         3309.0    BEMOL AVENIDA       3309.0
6                103       Tim         1550.0    BEMOL AVENIDA       1550.0
7                103      Vivo         4739.0    BEMOL AVENIDA       4739.0
8                105     Claro          720.0  BEMOL EDUCANDOS        720.0
9                105        Oi         2030.0  BEMOL EDUCANDOS       2030.0

## Tratamento pós-correlação

In [262]:
#Verificando se as colunas tem valores NaN
df_relatorio[df_relatorio['valor_bruto'].isna()]

     escritorio_vendas operadora  valor_liquido nome_fantasia  valor_bruto
141                614       Tim           10.0           NaN          NaN

In [263]:
#Verificando se as colunas tem valores NaN
df_relatorio[df_relatorio['valor_liquido'].isna()]

Empty DataFrame
Columns: [escritorio_vendas, operadora, valor_liquido, nome_fantasia, valor_bruto]
Index: []

In [264]:
#Verificando se as colunas tem valores NaN
df_relatorio[df_relatorio['operadora'].isna()]

Empty DataFrame
Columns: [escritorio_vendas, operadora, valor_liquido, nome_fantasia, valor_bruto]
Index: []

In [265]:
#Verificando se as colunas tem valores NaN
df_relatorio[df_relatorio['escritorio_vendas'].isna()]

Empty DataFrame
Columns: [escritorio_vendas, operadora, valor_liquido, nome_fantasia, valor_bruto]
Index: []

In [266]:
#Preenchendo os valores NaN da coluna 'valor_bruto'
df_relatorio['valor_bruto'] = df_relatorio['valor_bruto'].fillna(0)

In [267]:
df_relatorio[df_relatorio['nome_fantasia'].isna()]

     escritorio_vendas operadora  valor_liquido nome_fantasia  valor_bruto
141                614       Tim           10.0           NaN          0.0

In [268]:
#Encontrando o nome_fantasia pelo valor da 'escritorio_vendas'
df_relatorio['nome_fantasia'][df_relatorio['escritorio_vendas'] == 614]

139    BEMOL FARMA PRESIDENTE FIGUEIREDO
140    BEMOL FARMA PRESIDENTE FIGUEIREDO
141                                  NaN
142    BEMOL FARMA PRESIDENTE FIGUEIREDO
Name: nome_fantasia, dtype: object

In [269]:
#Preenchendo os valores NaN da coluna 'nome_fantasia'
df_relatorio['nome_fantasia'] = df_relatorio['nome_fantasia'].fillna('BEMOL FARMA PRESIDENTE FIGUEIREDO')

# Regra de negócio

## Operações entre colunas sem condicional

In [271]:
df_relatorio.head()

   escritorio_vendas operadora  valor_liquido  nome_fantasia  valor_bruto
0                101     Claro         1527.0   BEMOL MATRIZ       1527.0
1                101        Oi         1730.0   BEMOL MATRIZ       1730.0
2                101       Tim          975.0   BEMOL MATRIZ        975.0
3                101      Vivo         3142.0   BEMOL MATRIZ       3142.0
4                103     Claro         2652.3  BEMOL AVENIDA       2651.0

In [274]:
df_relatorio = df_relatorio[['nome_fantasia','operadora','valor_liquido','valor_bruto']]
df_relatorio.head(10)

     nome_fantasia operadora  valor_liquido  valor_bruto
0     BEMOL MATRIZ     Claro         1527.0       1527.0
1     BEMOL MATRIZ        Oi         1730.0       1730.0
2     BEMOL MATRIZ       Tim          975.0        975.0
3     BEMOL MATRIZ      Vivo         3142.0       3142.0
4    BEMOL AVENIDA     Claro         2652.3       2651.0
5    BEMOL AVENIDA        Oi         3309.0       3309.0
6    BEMOL AVENIDA       Tim         1550.0       1550.0
7    BEMOL AVENIDA      Vivo         4739.0       4739.0
8  BEMOL EDUCANDOS     Claro          720.0        720.0
9  BEMOL EDUCANDOS        Oi         2030.0       2030.0

## Operações entre colunas com condicional

In [279]:
def verifica_status(valor_liquido, valor_bruto):
        if(valor_liquido != valor_bruto):
            return 'alerta'

df_relatorio['status'] = df_relatorio.apply(lambda row: verifica_status(row['valor_liquido'], row['valor_bruto']), axis = 1)

In [280]:
df_relatorio

            nome_fantasia operadora  valor_liquido  valor_bruto  status
0            BEMOL MATRIZ     Claro         1527.0       1527.0    None
1            BEMOL MATRIZ        Oi         1730.0       1730.0    None
2            BEMOL MATRIZ       Tim          975.0        975.0    None
3            BEMOL MATRIZ      Vivo         3142.0       3142.0    None
4           BEMOL AVENIDA     Claro         2652.3       2651.0  alerta
..                    ...       ...            ...          ...     ...
158  BEMOL FARMA STUDIO 5      Vivo          561.0        380.0  alerta
159       BEMOL BOA VISTA     Claro          140.0        140.0    None
160       BEMOL BOA VISTA        Oi           20.0         20.0    None
161       BEMOL BOA VISTA       Tim          135.0        135.0    None
162       BEMOL BOA VISTA      Vivo          304.0        304.0    None

[163 rows x 5 columns]

# Exportando Dados

## Exportando formato .XLSX

In [287]:
#Renomeando as colunas para melhor visualização no Excel
df_relatorio = df_relatorio.rename(columns={'nome_fantasia':'loja','valor_liquido':'valor liquido', 'valor_bruto':'valor bruto'})

In [288]:
writer = pd.ExcelWriter('Relatorio Final.xlsx')
df_relatorio.to_excel(writer, sheet_name = 'relatorio', index= False)
writer.save()